src/turbinesFoamMy/tutorials/actuatorLine/static/system/blockMeshDict-2D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 2.16 -1.83 -0.05) // 0
    ( 2.16  1.83 -0.05) // 1
    (-1.50  1.83 -0.05) // 2
    (-1.50 -1.83 -0.05) // 3
    ( 2.16 -1.83  0.05) // 4
    ( 2.16  1.83  0.05) // 5
    (-1.50  1.83  0.05) // 6
    (-1.50 -1.83  0.05) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (30 30 1)
    simpleGrading (1 1 1)
);

patches
(
    patch inlet
    (
        (2 6 7 3) // (0 4 5 1)
    )
    patch outlet
    (
        (0 4 5 1) // (2 6 7 3)
    )
    wall walls
    (
        (1 5 6 2)
        (4 0 3 7)
    )
    empty front
    (
        (4 7 6 5)
    )
    empty back
    (
        (0 1 2 3)
    )
);

edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
